{
    "projects": [
      {
        "title": "AI-Powered Health Monitoring System for Indian Navy",
        "category": "nlp",
        "image": "/my_portfolio/images/health.png",
        "description": "Led the development of a smart AI-driven health tracking and advisory system for Indian Navy employees, integrating intelligent medical insights, interactive dashboards, and real-time assistance.",
        "keyFeatures": [
          "Interactive Dashboard: Role-based access for Admin, Doctors, and Employees",
          "AI-Powered Health Analysis: Users upload medical records; an AI agent analyzes reports and provides insights on causes, precautions, and diet",
          "Knowledge-Driven AI Agent: Built on medical literature and multiple sources for accurate recommendations",
          "AI Chatbot: Employees can discuss health concerns and receive real-time assistance",
          "FastAPI Backend: Supports multi-user sessions for seamless access",
          "Docker Deployment: Secured for local use on a private network Modern",
          "UI with React: Built an engaging and responsive fronten"
        ],
        "technologies": ["Python", "FastAPI", "AI Agents", "HuggingFace", "NLP", "React", "Docker", "Vector Database", "MySQL"],
        "demoLink": "https://github.com/SUMITDHAKAD0",
        "codeLink": "https://github.com/SUMITDHAKAD0"
      },
      {
        "title": "Intelligent News & Defense Data Extraction System",
        "category": "nlp",
        "image": "/my_portfolio/images/wesee.PNG",
        "description": "A robust system for extracting and structuring unstructured data from Pakistani news and defense sources, enabling efficient query-based retrieval and insightful analysis through an intelligent agent.",
        "keyFeatures": [
          "Web Scraping: Implemented Crawl4AI to scrape and collect data from multiple Pakistani news and defense websites, storing structured metadata in a MySQL database",
          "Data Processing: Applied text preprocessing, cleaning, and normalization to extract meaningful insights",
          "Vector Search: Created embeddings and stored them in a Milvus vector database for efficient similarity search",
          "RAG Pipeline: Built an Agentic RAG (Retrieval-Augmented Generation) pipeline with reranking and ensemble retrieval for high-accuracy responses",
          "Deployment: Backend powered by FastAPI, frontend developed with JavaScript, HTML, and CSS"
        ],
        "technologies": ["Python", "Langchain", "Crawl4AI", "FastAPI", "Milvus", "MySQL", "RAG", "JavaScript", "HTML", "CSS"],
        "demoLink": "#",
        "codeLink": "https://github.com/SUMITDHAKAD0"
      },
      {
        "title": "Real-Time Road Scenario Object Detection",
        "category": "computer-vision",
        "image": "/my_portfolio/images/traffic.jpg",
        "description": "A computer vision system for real-time detection of multiple road-related objects, including traffic signs, boards, speed breakers, and more. Trained and fine-tuned a YOLOv8 model on a custom dataset for high-accuracy predictions.",
        "keyFeatures": [
          "Implemented YOLOv8 with custom training on a self-collected dataset",
          "Annotated data in COCO format and converted to YOLO for training",
          "Achieved 89% mAP on the fine-tuned model",
          "Deployed using FastAPI for backend processing",
          "Built an interactive Streamlit application for real-time detection via video, image, and camera input",
          "Designed for efficient real-time inference on various deployment platforms"
        ],
        "technologies": ["Python", "PyTorch", "OpenCV", "Ultralytics", "YOLOv8", "FastAPI"],
        "demoLink": "#",
        "codeLink": "https://github.com/SUMITDHAKAD0/Road-Scenario-Object-Detection"
      },
      {
        "title": "AI-Powered Analytics Dashboard",
        "category": "machine-learning",
        "image": "/my_portfolio/images/Rag.png",
        "description": "A sophisticated analytics platform that leverages machine learning for data visualization and predictive analytics. Features include customizable dashboards, automated report generation, and trend analysis.",
        "keyFeatures": [
          "Integrated machine learning models for prediction",
          "Built interactive data visualizations",
          "Implemented real-time data processing",
          "Optimized performance for large datasets"
        ],
        "technologies": ["React", "Python", "TensorFlow", "scikit-learn", "PostgreSQL"],
        "demoLink": "#",
        "codeLink": "https://github.com/SUMITDHAKAD0"
      }
    ],
    "filters": [
      { "name": "All", "value": "all" },
      { "name": "Web Development", "value": "web-development" },
      { "name": "Web Application", "value": "web-application" },
      { "name": "Machine Learning", "value": "machine-learning" },
      { "name": "NLP", "value": "nlp" },
      { "name": "Computer Vision", "value": "computer-vision" },
      { "name": "Blockchain", "value": "blockchain" }
    ]
  }